benchmarks/OpenFOAM/2D/standingCapillaryWave/Cases/mycCartesian/RDF/coarsest/system/blockMeshDict
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 object blockMeshDict;
}

scale 0.0015;

vertices
  (
    (-1.000000 -0.250000 -3.000000)
    (1.000000 -0.250000 -3.000000)
    (1.000000 0.250000 -3.000000)
    (-1.000000 0.250000 -3.000000)
    (-1.000000 -0.250000 3.000000)
    (1.000000 -0.250000 3.000000)
    (1.000000 0.250000 3.000000)
    (-1.000000 0.250000 3.000000)
  ); 	//L #calc "1";//H #calc "3";//W #calc "0.25";//L #calc "-1";//H #calc "3";//W #calc "0.25";//0//1//2//3 //4//5//6//7

blocks
  (
    hex

    (
      0
      1
      2
      3
      4
      5
      6
      7
    )
    (8 1 24)
    simpleGrading
    (1 1 1)
  );

edges
  (
  );

boundary
  (
    walls

    {
      type wall;
      faces
        (

          (
            0
            1
            2
            3
          )

          (
            4
            5
            6
            7
          )
        );

    }
    left

    {
      type cyclic;
      neighbourPatch right;
      faces
        (

          (
            0
            3
            4
            7
          )
        );

    }
    right

    {
      type cyclic;
      neighbourPatch left;
      faces
        (

          (
            1
            2
            5
            6
          )
        );

    }
    front

    {
      type empty;
      faces
        (

          (
            0
            1
            4
            5
          )
        ); 	//neighbourPatch  back;

    }
    back

    {
      type empty;
      faces
        (

          (
            2
            3
            6
            7
          )
        ); 	//neighbourPatch  front;

    }
  );

mergePatchPairs
  (
  ); 	// ************************************************************************* //

